SoapTest/soap_config/29.set_bar_call_status.txt

<?xml version="1.0" encoding="UTF-8"?>

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
<S:Body>

<SubmitRequest xmlns="http://alcatel-lucent.com/esm/ws/svcmgr/V2_0">
    <SessionInfo>
        <sessionId>213824</sessionId>
    </SessionInfo>

    <RequestInfo>
        <ReqID></ReqID>
    </RequestInfo>


    <TaskList>
        <Task>
            <Name>Update Subscriber Account</Name>
            <ParamList>
                <Param>
                    <Name>Account ID</Name>
                    <Value>886906000015</Value>
                </Param>
               <Param>
                    <Name>Owner Name</Name>
                    <Value>corc</Value>
                </Param>
                <Param>
                    <Name>Bar Call Status</Name>
                    <Value>1</Value>
                </Param>
                <Param>
                    <Name>Generate AMA</Name>
                    <Value>Y</Value>
                </Param>
                <Param>
                    <Name>Transaction ID</Name>
                    <Value>MsgSoap029</Value>
                </Param>
            </ParamList>
        </Task>
    </TaskList>
</SubmitRequest>


</S:Body>
</S:Envelope>

